## Kaggle dataset - SF Salaries

In [3]:
from google.colab import files
uploaded = files.upload()

Saving Salaries.csv to Salaries.csv

In [7]:
import pandas as pd

In [19]:
sal_df = pd.read_csv("Salaries.csv")

In [20]:
# check head of dataframe
sal_df.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [21]:
# find how many entries there are 
sal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [22]:
# Find average Base pay
sal_df["BasePay"].mean()

66325.44884050643

In [23]:
# Highest amount of overtime pay
sal_df["OvertimePay"].max()

245131.88

In [24]:
# what is the job title of JOSEPH DRISCOLL?

# we have EmployeeName and JobTitle, data frame contains row and columns - 2D [row][col] to access information

# 1) find employee name 2) find job title
sal_df[sal_df["EmployeeName"] == "JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [25]:
# TotalPayBenefits of JOSEPH DRISCOLL?
sal_df[sal_df["EmployeeName"] == "JOSEPH DRISCOLL"]["TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [26]:
# highest paid person (including benefits)

# 1) find TotalPayBenefits 2) find max from the column
sal_df[sal_df["TotalPayBenefits"] == sal_df["TotalPayBenefits"].max()]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

In [27]:
# lowest paid person (including benefits)
# Do you notice something strange about how much he or she is paid?***

sal_df[sal_df["TotalPayBenefits"] == sal_df["TotalPayBenefits"].min()]

            Id EmployeeName  ...         Agency  Status
148653  148654    Joe Lopez  ...  San Francisco     NaN

[1 rows x 13 columns]

In [28]:
# Conlcusion from above data --> wrong data (since payment is -ve)

In [29]:
sal_df.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [30]:
# the average (mean) BasePay of all employees per year? 

# 1) from year column 2) find mean of basepay column
# as we are comparing 2 columns --> use groupby()

sal_df.groupby("Year").mean()["BasePay"]

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [31]:
# unique job titles
sal_df["JobTitle"].nunique()

2159

In [32]:
#  top 5 most common jobs

# to find top 5 --> use head()
# to count --> use value_counts()
sal_df["JobTitle"].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

### Tricky Questions

In [34]:
sal_df.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status              float64
dtype: object

In [37]:
# Job Titles with only one occurence in 2013

# 1) find year column of 2013 2) find job title
# 3) count 1 occurance 4) add (combine) all the occurances

sum(sal_df[sal_df['Year']==2013]['JobTitle'].value_counts() == 1)

202

In [45]:
# How many people have the word Chief in their job title?
def find_chief_string(title):
  # title is converted into lowercase, then split into a list
  # then "CHIEF" is checked if present in list
  if "chief" in title.lower().split():
    return True
  else:
    return False

In [46]:
# call the function above

# grab a random data from column --> sal_df["JobTitle"].iloc[0]/loc[0]

# apply lamda function to Job title column
# lamda x is accessing each data in the column

sum(sal_df['JobTitle'].apply(lambda x: find_chief_string(x)))

477

In [47]:
#  Is there a correlation between length of the Job Title string and Salary?

sal_df['title_len'] = sal_df['JobTitle'].apply(len) # find length of column

In [48]:
sal_df[['title_len','TotalPayBenefits']].corr() # No correlation.

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

In [ ]:
# ----------------- END -----------------